#### 22/04/25

# Exploratory Data Analysis(EDA):

- we have 4 important packages or modules available
- pandas
   - Data frame operations
- numpy
   - numerical operations
- matplotlib
   - for plotting
- seaborn
   - for plotting

In [ ]:
==============================  EDA  ============================================================
1) pandas           : Data frame operations
2) numpy            : math operations
3) matplotlib       : plotting or graphs
4) seaborn          : plotting or graphs
5) plotly           : plotting or graphs
6) bokhe            : plotting or graphs


============================  Machine learning  =================================================
7) scikit-learn(sklearn)    : For All ML algorithms
8) stats                   : Some statistical operations

============================  Deep learning  ====================================================
9) Tensorflow              : Deep learning models(Google)
9) keras                   : Deep learning models tensorflow as backend
10) pytorch                : Deep learning models(meta)
11) opencv                 : Image and video operations
12) pillow                 : Image operations


========================== Object Detection models(Transfer learning) =========================
14) Mobilenet              : Deep learning packages
15) VGGnet                 : Deep learning packages
16) Resnet                 : Deep learning packages
17) Inceptionv3            : Deep learning packages
18) YOLO                   : Deep learning packages


=========================== Natural language process =======================================
19) NLTK                   : Natural language tool kit
20) SpCy                   : Alternative to NLTK
21) wordcloud              : Text representation


=========================== NLP word Embedding Models =====================================
22) Word2Vec              : Google
23) GloVe                 : Stanford
24) Fasttext              : Meta(Face book)

=========================== ALLEN NLP(organization) =======================================
25) NLP applications      : Pyspark as Backend

=========================== optical character recognization(OCR) ===========================
Extract the text from the image
26) Tesseract
27) easyocr

=========================== BERT ========================================================
BERT : Bi directional Encoded Representations from Transformers
28) Transformers           : Hugging face (Google)

=========================== WebScrapping ===============================================
29) SQLITE                 : Connect the Database using python
30) Selenium
31) Beautiful soup
32) Regex

=========================== GenAI and LLM ==============================================
33) Langchain             : To connect all LLM models
34) GPT                   : OpenAI
35) Gemini                : Google
36) Llama                 : Meta
37) Grok                  : XAI
38) BedRock               : Amazon
39) Claude AI             : Anthropic


============================  Agentic AI ==================================================
40) Langraph
41) CrewAI
42) Phidata
43) Autogen


============================   API creation ==============================================
44) Flask
45) FastAPI
46) Gradio
47) Django

===========================   Web Application ===========================================
48) Streamlit

============================  Model deployment(MLops) ===================================
49) mlflow
50) kubeflow

============================  Cloud AI ==================================================
51) Azure Cognitive services
52) Azure ML Studion
53) GCP vertexAI
54) AWS sagemaker

============================  Extra ======================================================
55) random
56) time
57) math
58) logging
59) warnings
60) date

**Step-1: import packages**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Step-2: Create a DataFrame using List**

In [3]:
names=['Ramesh','Suresh','Mahesh']
pd.DataFrame(names)

        0
0  Ramesh
1  Suresh
2  Mahesh

In [4]:
names=['Ramesh','Suresh','Mahesh']
age=[20,21,22]
pd.DataFrame(names,age)

         0
20  Ramesh
21  Suresh
22  Mahesh

In [5]:
names=['Ramesh','Suresh','Mahesh']
age=[20,21,22]
pd.DataFrame(zip(names,age))

        0   1
0  Ramesh  20
1  Suresh  21
2  Mahesh  22

In [6]:
names=['Ramesh','Suresh','Mahesh']
age=[20,21,22]
city=['hyd','blr','chennai']
pd.DataFrame(zip(names,age,city))

        0   1        2
0  Ramesh  20      hyd
1  Suresh  21      blr
2  Mahesh  22  chennai

**Step-3: Insert the columns**

- column value expect an Index or Array-like

In [7]:
names=['Ramesh','Suresh','Mahesh']
pd.DataFrame(names,columns=['Names'])

    Names
0  Ramesh
1  Suresh
2  Mahesh

In [11]:
names=['Ramesh','Suresh','Mahesh']
age=[20,21,22]
city=['hyd','blr','chennai']
cols=['Names','Age','City']
pd.DataFrame(zip(names,age,city),columns=cols)

    Names  Age     City
0  Ramesh   20      hyd
1  Suresh   21      blr
2  Mahesh   22  chennai

**Step-4: Modify the index**

In [14]:
names=['Ramesh','Suresh','Mahesh']
age=[20,21,22]
city=['hyd','blr','chennai']
cols=['Names','Age','City']
idx=['A','B','C']
pd.DataFrame(zip(names,age,city),index=idx,columns=cols)

    Names  Age     City
A  Ramesh   20      hyd
B  Suresh   21      blr
C  Mahesh   22  chennai

In [16]:
names=['sonam','seema','monalisa']
age=[24,24,22]
city=['Jajpur','Keonjhar','Berhampur']
pd.DataFrame(zip(names,age,city))

          0   1          2
0     sonam  24     Jajpur
1     seema  24   Keonjhar
2  monalisa  22  Berhampur

In [5]:
names=['sonam','seema','monalisa']
age=[24,24,22]
city=['Jajpur','Keonjhar','Raigarh']
idx=['A','B','C']
cols=['Names','Age','City']
pd.DataFrame(zip(names,age,city),index=idx,columns=cols)

      Names  Age      City
A     sonam   24    Jajpur
B     seema   24  Keonjhar
C  monalisa   22   Raigarh

In [6]:
names=['Ramesh','Suresh','Mahesh']
age=[20,21,22]
city=['hyd','blr','chennai']
cols=['Names','Age','City']
idx=['A','B','C']
df1=pd.DataFrame(zip(names,age,city),index=idx,columns=cols)

In [7]:
type(df1)

pandas.core.frame.DataFrame

In [8]:
df1

    Names  Age     City
A  Ramesh   20      hyd
B  Suresh   21      blr
C  Mahesh   22  chennai

- index length should be match with number of rows
- columns length should be match with number of columns

**Step-5: Create Dataframe using Dictionary**

In [22]:
names=['Ramesh','Suresh','Mahesh']
age=[20,21,22]
city=['hyd','blr','chennai']

d={'Names':['Ramesh','Suresh','Mahesh'],
  'Age':[20,21,22],
  'City':['hyd','blr','chennai']}
pd.DataFrame(d)

# keys behave as column names
# no need of explicitly mention

    Names  Age     City
0  Ramesh   20      hyd
1  Suresh   21      blr
2  Mahesh   22  chennai

**Step-6: Create a DataFrame using scalar values**

In [24]:
d={'Names':'Ramesh',
  'Age':20,
  'City':'hyd'}
pd.DataFrame(d)

ValueError: If using all scalar values, you must pass an index

In [25]:
d={'Names':'Ramesh',
  'Age':20,
  'City':'hyd'}
pd.DataFrame(d,index=[1,2])

    Names  Age City
1  Ramesh   20  hyd
2  Ramesh   20  hyd

**Step-7: Data quick checks**

- shape
- size
- len
- columns
- dtypes

In [26]:
df1

    Names  Age     City
A  Ramesh   20      hyd
B  Suresh   21      blr
C  Mahesh   22  chennai

In [27]:
df1.shape

(3, 3)

In [28]:
df1.size

9

In [35]:
len(df1)

3

In [30]:
df1.columns

Index(['Names', 'Age', 'City'], dtype='object')

In [31]:
df1.dtypes

Names    object
Age       int64
City     object
dtype: object

#### 23/04/25

**Step-8: Add data to empty dataframe**

In [2]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [4]:
d1=pd.DataFrame()
d1['Names']=['Ramesh','Suresh','Mahesh']
d1['Age']=[20,21,22]
d1

    Names  Age
0  Ramesh   20
1  Suresh   21
2  Mahesh   22

**Step-9: Add data to already existed Dataframe**
- df1 already has a data with columns Names,Age,City
- Now we want to create a new column with Marks

In [9]:
df1

    Names  Age     City
A  Ramesh   20      hyd
B  Suresh   21      blr
C  Mahesh   22  chennai

In [10]:
df1['Marks']=[100,200,300]
df1

    Names  Age     City  Marks
A  Ramesh   20      hyd    100
B  Suresh   21      blr    200
C  Mahesh   22  chennai    300

**Step-10: How to update the column values**
- If you want to add the new column to empty dataframe
- If you want to add the new column to already existed dataframe
- If you want to notify the data of a specific column
- syntax is same
- df[colname]=[data]

In [12]:
df1['City']=['Odisha','Pune','Mumbai']
df1

    Names  Age    City  Marks
A  Ramesh   20  Odisha    100
B  Suresh   21    Pune    200
C  Mahesh   22  Mumbai    300

**Step-11: How to drop the specific column**
- by default axis=0 represents index
- if you provide the column change axis=1
- inplace = True the Data frame will be overwrite

In [13]:
df1['city']=['Odisha','Pune','Mumbai']
df1

    Names  Age    City  Marks    city
A  Ramesh   20  Odisha    100  Odisha
B  Suresh   21    Pune    200    Pune
C  Mahesh   22  Mumbai    300  Mumbai

In [14]:
df1.drop('city')

KeyError: "['city'] not found in axis"

In [15]:
df1.drop('city',axis=1)

    Names  Age    City  Marks
A  Ramesh   20  Odisha    100
B  Suresh   21    Pune    200
C  Mahesh   22  Mumbai    300

In [16]:
df1

    Names  Age    City  Marks    city
A  Ramesh   20  Odisha    100  Odisha
B  Suresh   21    Pune    200    Pune
C  Mahesh   22  Mumbai    300  Mumbai

In [20]:
df1.drop('city',
         axis=1,
         inplace=True)

KeyError: "['city'] not found in axis"

In [21]:
df1

    Names  Age    City  Marks
A  Ramesh   20  Odisha    100
B  Suresh   21    Pune    200
C  Mahesh   22  Mumbai    300

In [25]:
df1.drop(columns='age',inplace=True)

KeyError: "['age'] not found in axis"

In [26]:
df1

    Names  Age    City  Marks
A  Ramesh   20  Odisha    100
B  Suresh   21    Pune    200
C  Mahesh   22  Mumbai    300

In [27]:
df1['age']=[20,24,25]
df1['city']=['D','C','P']
df1

    Names  Age    City  Marks  age city
A  Ramesh   20  Odisha    100   20    D
B  Suresh   21    Pune    200   24    C
C  Mahesh   22  Mumbai    300   25    P

In [28]:
df1.drop(columns=['age','city'])

    Names  Age    City  Marks
A  Ramesh   20  Odisha    100
B  Suresh   21    Pune    200
C  Mahesh   22  Mumbai    300

In [31]:
df1.drop(['A'])

    Names  Age    City  Marks  age city
B  Suresh   21    Pune    200   24    C
C  Mahesh   22  Mumbai    300   25    P

In [32]:
df1.drop(labels=['A'])

    Names  Age    City  Marks  age city
B  Suresh   21    Pune    200   24    C
C  Mahesh   22  Mumbai    300   25    P

In [33]:
df1

    Names  Age    City  Marks  age city
A  Ramesh   20  Odisha    100   20    D
B  Suresh   21    Pune    200   24    C
C  Mahesh   22  Mumbai    300   25    P

**Step-12: Rename the column**
- create a dictionary key as old name value as new name

In [34]:
dict1={'Marks':'marks'}
df1.rename(dict1,axis=1)  # dont do inplace

    Names  Age    City  marks  age city
A  Ramesh   20  Odisha    100   20    D
B  Suresh   21    Pune    200   24    C
C  Mahesh   22  Mumbai    300   25    P

In [36]:
dict1={'Names':'names'}
df1.rename(columns=dict1)

    names  Age    City  Marks  age city
A  Ramesh   20  Odisha    100   20    D
B  Suresh   21    Pune    200   24    C
C  Mahesh   22  Mumbai    300   25    P

In [37]:
df1.drop(['age','city'],axis=1,inplace=True)

In [38]:
df1

    Names  Age    City  Marks
A  Ramesh   20  Odisha    100
B  Suresh   21    Pune    200
C  Mahesh   22  Mumbai    300

In [39]:
df1.columns=['names','age','city','marks']
df1

    names  age    city  marks
A  Ramesh   20  Odisha    100
B  Suresh   21    Pune    200
C  Mahesh   22  Mumbai    300

**Step-13: Add a new row**

In [ ]:
df1.loc[<index>]=[data]

In [43]:
df1.loc['D']=['Manish',23,'Hyd',400]

In [44]:
df1

    names  age    city  marks
A  Ramesh   20  Odisha    100
B  Suresh   21    Pune    200
C  Mahesh   22  Mumbai    300
D  Manish   23     Hyd    400

**Step-14: Save the DataFrame**

In [45]:
df1

    names  age    city  marks
A  Ramesh   20  Odisha    100
B  Suresh   21    Pune    200
C  Mahesh   22  Mumbai    300
D  Manish   23     Hyd    400

In [48]:
df1.to_csv('data.csv')

**Step-15: Read the DataFrame**

In [52]:
pd.read_csv('data.csv')

  Unnamed: 0   names  age    city  marks
0          A  Ramesh   20  Odisha    100
1          B  Suresh   21    Pune    200
2          C  Mahesh   22  Mumbai    300
3          D  Manish   23     Hyd    400

In [55]:
df1.to_csv('data.csv',index=False) 
pd.read_csv('data.csv')

    names  age    city  marks
0  Ramesh   20  Odisha    100
1  Suresh   21    Pune    200
2  Mahesh   22  Mumbai    300
3  Manish   23     Hyd    400

In [56]:
df1.to_excel('data.xlsx',index=False) # can you try with excel
pd.read_excel('data.xlsx') # read with

    names  age    city  marks
0  Ramesh   20  Odisha    100
1  Suresh   21    Pune    200
2  Mahesh   22  Mumbai    300
3  Manish   23     Hyd    400